

export default function Home () {
  
    return<div className="home">
    <h1>Данное приложение разработанно для демострации навыков:</h1>
    <ul>
        <li><h3>React JS</h3></li>
        <li><h3>TypeScript JS</h3></li>
        <li><h3>UI библиотеки Ant Design of React</h3></li>
        <li><h3>React Query</h3></li>
        <li><h3>React Router Dom</h3></li>
        <li><h3>FireBase</h3></li>
    </ul>
    <h2>Краткое описание функционала:</h2>
    <ul>
        <li><h3>Меню header реализован постраничный роутинг</h3></li>
        <li><h3>Вкладка "Наша команда" демонстрирует зарегестрированных пользователей с ролью тренер с возможностью оценить и оставить отзыв</h3></li>
        <li><h3>Личный кабинет реализована регистрация и авторизация </h3></li>
        <li><h3>После авторизации доступна вкладка "Профиль"</h3></li>
        <li><h3>Функционал роли "Спортсмен" немного отличаеися от роли "Тренер"</h3></li>
        <li><h3>В "Профиле" реализован функционал настройки профиля, редактирование расписания и другое</h3></li>

    </ul>
    </div>
}